sonukmrsah/LoRa-WAN-range-test/EFR32xG23B/rail_soc_range_test/autogen/sl_cli_command_table.c
/***************************************************************************//**
 * @file sl_cli_command_table.c
 * @brief Declarations of relevant command structs for cli framework.
 * @version x.y.z
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stdlib.h>

#include "sl_cli_config.h"
#include "sl_cli_command.h"
#include "sl_cli_arguments.h"

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 *****************************   TEMPLATED FILE   ******************************
 ******************************************************************************/

/*******************************************************************************
 * Example syntax (.slcc or .slcp) for populating this file:
 *
 *   template_contribution:
 *     - name: cli_command          # Register a command
 *       value:
 *         name: status             # Name of command
 *         handler: status_command  # Function to be called. Must be defined
 *         help: "Prints status"    # Optional help description
 *         shortcuts:               # Optional shorcut list
 *           - name: st
 *         argument:                # Argument list, if apliccable
 *           - type: uint8          # Variable type
 *             help: "Channel"      # Optional description
 *           - type: string
 *             help: "Text"
 *     - name: cli_group            # Register a group
 *       value:
 *         name: shell              # Group name
 *         help: "Shell commands"   # Optional help description
 *         shortcuts:               # Optional shorcuts
 *           - name: sh
 *     - name: cli_command
 *       value:
 *         name: repeat
 *         handler: repeat_cmd
 *         help: "Repeat commands"
 *         shortcuts:
 *           - name: r
 *           - name: rep
 *         group: shell            # Associate command with group
 *         argument:
 *           - type: string
 *             help: "Text"
 *           - type: additional
 *             help: "More text"
 *
 * For subgroups, an optional unique id can be used to allow a particular name to
 * be used more than once. In the following case, from the command line the
 * following commands are available:
 *
 * >  root_1 shell status
 * >  root_2 shell status
 *
 *     - name: cli_group            # Register a group
 *       value:
 *         name: root_1             # Group name
 *
 *     - name: cli_group            # Register a group
 *       value:
 *         name: root_2             # Group name
 *
 *    - name: cli_group             # Register a group
 *       value:
 *         name: shell              # Group name
 *         id: shell_root_1         # Optional unique id for group
 *         group: root_1            # Add group to root_1 group
 *
 *    - name: cli_group             # Register a group
 *       value:
 *         name: shell              # Group name
 *         id: shell_root_2         # Optional unique id for group
 *         group: root_2            # Add group to root_1 group
 *
 *    - name: cli_command           # Register a command
 *       value:
 *         name: status
 *         handler: status_1
 *         group: shell_root_1      # id of subgroup
 *
 *    - name: cli_command           # Register a command
 *       value:
 *         name: status
 *         handler: status_2
 *         group: shell_root_2      # id of subgroup
 *
 ******************************************************************************/

// Provide function declarations
void cli_get_print_package_info(sl_cli_command_arg_t *arguments);
void cli_set_print_package_info(sl_cli_command_arg_t *arguments);
void cli_info(sl_cli_command_arg_t *arguments);
void cli_list_phys(sl_cli_command_arg_t *arguments);
void cli_get_mode(sl_cli_command_arg_t *arguments);
void cli_get_phy(sl_cli_command_arg_t *arguments);
void cli_get_power(sl_cli_command_arg_t *arguments);
void cli_get_frequency(sl_cli_command_arg_t *arguments);
void cli_get_channel_number(sl_cli_command_arg_t *arguments);
void cli_get_payload_length(sl_cli_command_arg_t *arguments);
void cli_get_packet_count(sl_cli_command_arg_t *arguments);
void cli_get_remote_id(sl_cli_command_arg_t *arguments);
void cli_get_self_id(sl_cli_command_arg_t *arguments);
void cli_get_ma_window_size(sl_cli_command_arg_t *arguments);
void cli_get_usart_log_enable(sl_cli_command_arg_t *arguments);
void cli_set_mode(sl_cli_command_arg_t *arguments);
void cli_set_phy(sl_cli_command_arg_t *arguments);
void cli_set_power(sl_cli_command_arg_t *arguments);
void cli_set_channel_number(sl_cli_command_arg_t *arguments);
void cli_set_payload_length(sl_cli_command_arg_t *arguments);
void cli_set_packet_count(sl_cli_command_arg_t *arguments);
void cli_set_remote_id(sl_cli_command_arg_t *arguments);
void cli_set_self_id(sl_cli_command_arg_t *arguments);
void cli_set_ma_window_size(sl_cli_command_arg_t *arguments);
void cli_set_usart_log_enable(sl_cli_command_arg_t *arguments);
void cli_start_measurement(sl_cli_command_arg_t *arguments);
void cli_stop_measurement(sl_cli_command_arg_t *arguments);

// Command structs. Names are in the format : cli_cmd_{command group name}_{command name}
// In order to support hyphen in command and group name, every occurence of it while
// building struct names will be replaced by "_hyphen_"
static const sl_cli_command_info_t cli_cmd__get_print_package_info = \
  SL_CLI_COMMAND(cli_get_print_package_info,
                 "Get the print setting",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_print_package_info = \
  SL_CLI_COMMAND(cli_set_print_package_info,
                 "Set the print setting",
                  "ON/OFF" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__info = \
  SL_CLI_COMMAND(cli_info,
                 "Information about all configuration",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__list_phys = \
  SL_CLI_COMMAND(cli_list_phys,
                 "List all available phys with phy number",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_mode = \
  SL_CLI_COMMAND(cli_get_mode,
                 "Information about mode",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_phy = \
  SL_CLI_COMMAND(cli_get_phy,
                 "Information about phy",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_power = \
  SL_CLI_COMMAND(cli_get_power,
                 "Information about power",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_frequency = \
  SL_CLI_COMMAND(cli_get_frequency,
                 "Information about frequency",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_channel_number = \
  SL_CLI_COMMAND(cli_get_channel_number,
                 "Information about channel number",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_payload_length = \
  SL_CLI_COMMAND(cli_get_payload_length,
                 "Information about payload length",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_packet_count = \
  SL_CLI_COMMAND(cli_get_packet_count,
                 "Information about packet count",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_remote_id = \
  SL_CLI_COMMAND(cli_get_remote_id,
                 "Information about remote id",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_self_id = \
  SL_CLI_COMMAND(cli_get_self_id,
                 "Information about self id",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_ma_window_size = \
  SL_CLI_COMMAND(cli_get_ma_window_size,
                 "Information about MA window size",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__get_usart_log_enable = \
  SL_CLI_COMMAND(cli_get_usart_log_enable,
                 "Information about uart log enable",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_mode = \
  SL_CLI_COMMAND(cli_set_mode,
                 "Set the device mode",
                  "RX/TX" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_phy = \
  SL_CLI_COMMAND(cli_set_phy,
                 "Set the device phy",
                  "Number of the phy starting from 0" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_power = \
  SL_CLI_COMMAND(cli_set_power,
                 "Set the device power",
                  "TX power level in deci-dBm" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_channel_number = \
  SL_CLI_COMMAND(cli_set_channel_number,
                 "Set the device channel",
                  "Channel number" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_payload_length = \
  SL_CLI_COMMAND(cli_set_payload_length,
                 "Set the device payload length",
                  "Payload length" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_packet_count = \
  SL_CLI_COMMAND(cli_set_packet_count,
                 "Set the device packet count",
                  "Packet count : 0:500, 1:1000, 2:2500, 3:5000, 4:10000, 5:25000, 6:50000, 7:Repeat" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_remote_id = \
  SL_CLI_COMMAND(cli_set_remote_id,
                 "Set the device remote id",
                  "Remote id, 0 - 32" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_self_id = \
  SL_CLI_COMMAND(cli_set_self_id,
                 "Set the device self id",
                  "Self id, 0 - 32" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_ma_window_size = \
  SL_CLI_COMMAND(cli_set_ma_window_size,
                 "Set the device MA window size",
                  "MA window size: 32, 64 or 128" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__set_usart_log_enable = \
  SL_CLI_COMMAND(cli_set_usart_log_enable,
                 "Set the device uart log enable",
                  "0:OFF / 1:ON" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__start_measurement = \
  SL_CLI_COMMAND(cli_start_measurement,
                 "Start measurement with configured values",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd__stop_measurement = \
  SL_CLI_COMMAND(cli_stop_measurement,
                 "Stop measurement",
                  "",
                 {SL_CLI_ARG_END, });


// Create group command tables and structs if cli_groups given
// in template. Group name is suffixed with _group_table for tables
// and group commands are cli_cmd_grp_( group name )
// Create root command table
const sl_cli_command_entry_t sl_cli_default_command_table[] = {
  { "get_print_package_info", &cli_cmd__get_print_package_info, false },
  { "set_print_package_info", &cli_cmd__set_print_package_info, false },
  { "info", &cli_cmd__info, false },
  { "list_phys", &cli_cmd__list_phys, false },
  { "get_mode", &cli_cmd__get_mode, false },
  { "get_phy", &cli_cmd__get_phy, false },
  { "get_power", &cli_cmd__get_power, false },
  { "get_frequency", &cli_cmd__get_frequency, false },
  { "get_channel_number", &cli_cmd__get_channel_number, false },
  { "get_payload_length", &cli_cmd__get_payload_length, false },
  { "get_packet_count", &cli_cmd__get_packet_count, false },
  { "get_remote_id", &cli_cmd__get_remote_id, false },
  { "get_self_id", &cli_cmd__get_self_id, false },
  { "get_ma_window_size", &cli_cmd__get_ma_window_size, false },
  { "get_usart_log_enable", &cli_cmd__get_usart_log_enable, false },
  { "set_mode", &cli_cmd__set_mode, false },
  { "set_phy", &cli_cmd__set_phy, false },
  { "set_power", &cli_cmd__set_power, false },
  { "set_channel_number", &cli_cmd__set_channel_number, false },
  { "set_payload_length", &cli_cmd__set_payload_length, false },
  { "set_packet_count", &cli_cmd__set_packet_count, false },
  { "set_remote_id", &cli_cmd__set_remote_id, false },
  { "set_self_id", &cli_cmd__set_self_id, false },
  { "set_ma_window_size", &cli_cmd__set_ma_window_size, false },
  { "set_usart_log_enable", &cli_cmd__set_usart_log_enable, false },
  { "start_measurement", &cli_cmd__start_measurement, false },
  { "stop_measurement", &cli_cmd__stop_measurement, false },
  { NULL, NULL, false },
};


#ifdef __cplusplus
}
#endif
